package ru.javaprojects.doccopymaker;

import java.util.Arrays;
import java.util.List;

public class TestData {
    public static List<String> docsConsignmentNoteDecimalNumbers = Arrays.asList("ВУИА.301233.055", "ВУИА.301233.055СБ", "ВУИА.436338.003-01", "ВУИА.436338.003-01ПЭ3",
            "ВУИА.436338.003-01СБ", "ВУИА.436338.003-01ТУ", "ВУИА.436338.003-01Э3", "ВУИА.469135.049", "ВУИА.469135.049СБ", "ВУИА.469135.050", "ВУИА.469135.050СБ",
            "ВУИА.469135.051", "ВУИА.469135.051СБ", "ВУИА.469345.080", "ВУИА.469345.080СБ", "ВУИА.469345.082", "ВУИА.469345.082СБ", "ВУИА.687281.224",
            "ВУИА.687281.224СБ", "ВУИА.687281.237", "ВУИА.687281.237СБ", "ВУИА.735332.011", "ВУИА.735332.012", "ВУИА.741124.1152", "ВУИА.741124.1176",
            "ВУИА.741124.1177", "ВУИА.741128.808", "ВУИА.745532.225", "ВУИА.752699.003", "ВУИА.757746.025", "ЮПИЯ.468151.009", "ЮПИЯ.685442.033", "ЮПИЯ.686171.006");
    public static List<String> changeNoticesConsignmentNoteDecimalNumbers = Arrays.asList("ВУИА.468365.077", "ЮПИЯ.436737.007", "ВУИА.468364.014", "ВУИА.468364.014СБ",
            "ЮПИЯ.469132.043", "ЮПИЯ.301211.049", "ЮПИЯ.468362.010", "ВУИА.687283.052", "БА1.640.016-02ЭД", "БА1.640.016-02Д63", "БА1.640.016-02",
            "ЮПИЯ.467444.005СБ", "ЮПИЯ.468362.007-01ПЭ3", "ВУИА.301412.174", "ЮПИЯ.685661.108", "ВУИА.305142.041");
    public static List<String> regularTableDecimalNumbers = Arrays.asList("ВУИА.301233.055", "ВУИА.301233.055СБ", "ВУИА.469135.049", "ВУИА.469135.049СБ", "ВУИА.436338.003-01ПЭ3");
}